Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationError Property
 Cannot create specified fillet at rail path corner.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailFilletCreationError { get; }
Public Shared ReadOnly Property ContinuousRailFilletCreationError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationError {
	FailureDefinitionId^ get ();
}
static member ContinuousRailFilletCreationError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace